{
  "id": "job_20250909_155832",
  "title": "Software Engineer",
  "description": "We are seeking an experienced Full-Stack Developer with over 7 years of hands-on experience in building scalable, high-quality web applications using Java and Angular. As a senior developer, you will play a key role in the design, development, and maintenance of both the frontend and backend components of our enterprise-grade platforms.\r\n\r\nIf you are eager to contribute to a dynamic, collaborative development environment, we would love to hear from you.\r\n\r\nYour future duties and responsibilities\r\n• Design, develop, and maintain full-stack applications using Java (Spring Boot, REST APIs) and Angular.\r\n• Collaborate with cross-functional teams including product managers, UX designers, and QA engineers to deliver high-quality solutions.\r\n• Lead and mentor junior developers through code reviews, pair programming, and technical guidance.\r\n• Implement unit testing, integration testing, and participate in CI/CD pipelines.\r\n• Optimize applications for performance, scalability, and security.\r\n• Define our next unit and integration test frameworks and standards.\r\n• Ensure we have the proper tools in place so that we can ensure our applications are free of common coding vulnerabilities and we follow standard security practices.\r\n• Design and develop highly complex and custom components.\r\n• Participate in architectural discussions and contribute to technical decisions.\r\n• Troubleshoot, debug, and resolve production issues effectively.\r\n• Stay updated with emerging technologies and best practices in full-stack development.\r\n\r\nRequired Qualifications To Be Successful In This Role\r\n• Location: Halifax, Nova Scotia, Canada (Alternate locations: Moncton, Fredericton, Stratford or St. John's)\r\n• Hybrid: 3-4 days required in office weekly\r\n• 7+ years of professional experience in software development.\r\n• Strong proficiency in Java and related frameworks (e.g., Spring Boot, Hibernate).\r\n• Expert-level knowledge of Angular (preferably v10+), TypeScript.\r\n• Solid understanding of RESTful web services and API design.\r\n• Experience with SQL and NoSQL databases (e.g., PostgreSQL, MongoDB).\r\n• Familiarity with Git, Jenkins, Docker, and other DevOps tools.\r\n• Experience working in an Agile/Scrum environment.\r\n• Excellent problem-solving skills and attention to detail.\r\n• Strong communication skills and ability to work in a collaborative team environment.\r\n• Experience with microservices architecture.\r\n• Familiarity with containerization technologies (Docker, Kubernetes).\r\n• Knowledge of AWS cloud platform.\r\n• Good to have experience with automated testing frameworks.\r\n• Exposure to CI/CD practices and tools like GitLab CI/CD, etc.\r\n\r\nTogether, as owners, let’s turn meaningful insights into action.\r\n\r\nLife at CGI is rooted in ownership, teamwork, respect and belonging. Here, you’ll reach your full potential because…\r\n\r\nYou are invited to be an owner from day 1 as we work together to bring our Dream to life. That’s why we call ourselves CGI Partners rather than employees. We benefit from our collective success and actively shape our company’s strategy and direction.\r\n\r\nYour work creates value. You’ll develop innovative solutions and build relationships with teammates and clients while accessing global capabilities to scale your ideas, embrace new opportunities, and benefit from expansive industry and technology expertise.",
  "required_skills": [
    ""
  ],
  "experience_years": 0,
  "education_level": "",
  "created_date": "2025-09-09T15:58:32.763787"
}